# Напишите программу, которая производит вычисление выражения, записанного в обратной польской нотации (ОПН).

# Формат ввода
# вводится одна строка, содержащая разделённые пробелами целые числа и знаки операций +, -, *,
# которые вместе составляют корректное выражение в обратной польской нотации.

# Формат вывода
# выводится одно целое число — результат вычисления выражения.

result: int = 0
strInp = input()


print(result)
