# Длина трассы — 43872м, и зрители хотят узнать имя победителя.

# Нам известны средние скорости трёх фаворитов – Пети, Васи и Толи.
# Помогите подвести итоги гонки.

# Формат ввода
# В первой строке записана средняя скорость Пети.
# Во второй — Васи.
# В третьей — Толи.

# Формат вывода
# Имена победителей в порядке занятых мест.

Petya = int(input())
Vasya = int(input())
Tolya = int(input())

if Vasya < Tolya < Petya:
    print(f"1. Петя\n2. Толя\n3. Вася")
elif Tolya < Vasya < Petya:
    print(f"1. Петя\n2. Вася\n3. Толя")
elif Petya < Tolya < Vasya:
    print(f"1. Вася\n2. Толя\n3. Петя")
elif Tolya < Petya < Vasya:
    print(f"1. Вася\n2. Петя\n3. Толя")
elif Vasya < Petya < Tolya:
    print(f"1. Толя\n2. Петя\n3. Вася")
else:
    print(f"1. Толя\n2. Вася\n3. Петя")
